Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.argocd-application.argocd_application.fetch-system-streams is tainted, so must be replaced
-/+ resource "argocd_application" "fetch-system-streams" {
      ~ id       = "fetch-system-streams:argocd" -> (known after apply)
      ~ status   = [
          - {
              - conditions      = []
              - health          = [
                  - {
                      - status  = "Progressing"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - operation_state = [
                  - {
                      - finished_at = "2025-02-01 11:49:58 +0000 UTC"
                      - message     = "successfully synced (all tasks run)"
                      - phase       = "Succeeded"
                      - retry_count = "0"
                      - started_at  = "2025-02-01 11:49:57 +0000 UTC"
                    },
                ]
              - reconciled_at   = "2025-02-01 12:03:40 +0000 UTC"
              - resources       = [
                  - {
                      - group            = "apps"
                      - health           = [
                          - {
                              - message = "Waiting for rollout to finish: 0 of 1 updated replicas are available..."
                              - status  = "Progressing"
                            },
                        ]
                      - hook             = false
                      - kind             = "Deployment"
                      - name             = "fetch-system-streams"
                      - namespace        = "fetch-system"
                      - requires_pruning = false
                      - status           = "Synced"
                      - sync_wave        = "0"
                      - version          = "v1"
                    },
                ]
              - summary         = [
                  - {
                      - external_urls = []
                      - images        = [
                          - "docker.io/istio/proxyv2:1.24.2",
                          - "registry.goboolean.io/fetch-system/streams:e755d8b",
                        ]
                    },
                ]
              - sync            = [
                  - {
                      - revision  = "8dde247ecac6ee680fd3c658366ca9a628cbb0d7"
                      - revisions = []
                      - status    = "Synced"
                    },
                ]
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 31 -> (known after apply)
          - labels           = {} -> null
            name             = "fetch-system-streams"
          ~ resource_version = "5588963" -> (known after apply)
          ~ uid              = "b60ef10c-7fde-4849-9d8b-ea479e9a6489" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ sync_policy {
              - sync_options = [] -> null

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
